# 1)Дан лист:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
# - 1 найти min число в листе
# - 2 удалить все одинаковые значения
# - 3 заменить каждое четвертое значение на "Х"
#  - 4 вывести элемент листа, значение которого ближе всего к среднему арифметическому всех элементов этого же листа
# пример:
# [1, 2, 3, 4, 5, 6, 7, 8, 9] => 5
# [-1, -2, 3, 4, 555] => 4
# [5, 5, 5, 5] => 5
# [-10, 5, 5] => 5
# 2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:
# 3) переделать первое задание под меню с помощью цикла
# 4) вывести табличку умножения с помощью цикла while

    # Забыл
    # вам
    # показать
    # отрицание:
    # в
    # js
    # у
    # вас
    # было:
    # !true -> false
    # в
    # python:
    # not True -> False
    #
    # так
    # же
    # вместо | | тут
    # используется
    # слово or, и
    # вместо & & слово and

# print('hello world')

list1 = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]
# 1 print(min(list1))

# list1.remove(2)
# print(list1)
# print(list1.count(22))
# print(list1[3::4])

# 2 ?????????????
# for i in list1:
#     if

# # 3
# for i in list1[::4]:
#     list1[list1.index(i)] = 'x'
#     print(i)
print(list1)









