# прога, що виводить кількість кожного символа з введеної строки,
# наприклад:
# st = 'as 23 fdfdg544' #введена строка
#
# 'a' -> 1  #вивело в консолі
# 's' -> 1
# ' ' -> 2
# '2' -> 1
# '3' -> 1
# 'f' -> 2
# 'd' -> 2
# 'g' -> 1
# '5' -> 1
# '4' -> 2
# """
#
# list comprehension
#
# 1)  есть лист:
# numbers = [1, 2, 3, 4, 5, 6, 7, 8]
# создать новый лист и записать в него 'GT' если элемент в numbers больше 4 и 'LT' если элемент меньше или равен 4
# пример:
# ['LT', 'LT', 'LT', 'LT', 'GT', 'GT', 'GT', 'GT']
#
# 2) есть два листа:
# list1 = [1, 2, 3, 4, 5]
# list2 = [-1, 7, 10, -5, -2]
#
# записать в лист тюплы (x,y) если x+y == 0
# пример:
# [(1, -1), (2, -2), (5, -5)]

# ==========================================================================================
# 1 прога, що виводить кількість кожного символа з введеної строки,

# string1 = input('Enter your string:')
#
# for i in string1:
#     print(i, '->', string1.count(i))
# ==========================================================================================


# 1)  есть лист:
# # numbers = [1, 2, 3, 4, 5, 6, 7, 8]
# # создать новый лист и записать в него 'GT' если элемент в numbers больше 4 и 'LT' если элемент меньше или равен 4
# # пример:
# # ['LT', 'LT', 'LT', 'LT', 'GT', 'GT', 'GT', 'GT']

# numbers = [1, 2, 3, 4, 5, 6, 7, 8]
#
# abr = ['GT' if i > 4 else 'LT' for i in numbers]
#
# print(abr)

# ==========================================================================================
#  2) есть два листа:
# list1 = [1, 2, 3, 4, 5]
# list2 = [-1, 7, 10, -5, -2]
# #
# # записать в лист тюплы (x,y) если x+y == 0
# # пример:
# # [(1, -1), (2, -2), (5, -5)]
#
# result_list = [(x, y) for x in list1 for y in list2 if x + y == 0]
#
# print(result_list)

# ==========================================================================================




